C_TJunctionTrace/TJunctionFlowSimple/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    inletLeft
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01; //Take half of inlet width
        value           $internalField;
    }

    inletBottom
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0075; //Take half of inlet width
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    defaultFaces
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
